// video
import Post from './components/post/post';
import video1 from './media/video1.MP4'
import video2 from './media/2.MOV'
import video3 from './media/3.MOV'
import video4 from './media/IMG_3859.MP4'
import video5 from './media/IMG_3860.MOV'
import video6 from './media/IMG_3840.MOV'
import video7 from './media/IMG_3839.MOV'
import video8 from './media/IMG_3838.MOV'
import video9 from './media/IMG_3835.MP4'
import video10 from './media/IMG_3827.MOV'
import video11 from './media/IMG_3823.MOV'
import video12 from './media/IMG_3814.MOV'
import video13 from './media/IMG_3813.MOV'
import video14 from './media/IMG_3792.MOV'
import video15 from './media/IMG_3791.MOV'
import video16 from './media/IMG_3787.MP4'
import video17 from './media/IMG_3786.MOV'
import video18 from './media/IMG_3711.MP4'
import video19 from './media/IMG_3969.MOV'
import video20 from './media/IMG_3970.MOV'
import video21 from './media/IMG_3972.MOV'
import video22 from './media/IMG_3973.MOV'
import video23 from './media/IMG_3974.MOV'
import video24 from './media/IMG_3705.MOV'
import video25 from './media/IMG_3706.MOV'
import video26 from './media/IMG_3985.MOV'
import video27 from './media/IMG_3976.MOV'
import video28 from './media/IMG_3987.MOV'
import video29 from './media/IMG_3990.MOV'
import video30 from './media/IMG_3991.MP4'
import video31 from './media/IMG_3992.MOV'
import video32 from './media/IMG_3999.MOV'
import './styles/App.css';

function App() {
  return (
    <div className='continer'>
      <div className='wrapper'>
        <div className='wrapperInner_left'>
          <Post username={"Маша"} src={video1} text="С днём рождения, Стеша‼️ Пусть твоя жизнь будет наполнена радостью, улыбками и любовью. Желаю тебе здоровья, успехов в учёбе, много интересных и полезных занятий, а также настоящих друзей, которые всегда будут рядом в любых жизненных ситуациях." />

          <Post username={"Лера"} src={video2} text="Стеша, поздравляю тебя с днём рождения!! Желаю тебе идти к своим целям, никогда не сдаваться, наслаждаться всеми моментами и всего самого наилучшего. Ты большая умница и уже много чего добилась за свои 15 лет, я уверена, что в этом году ты получишь ещё больше хороших результатов, эмоций и успехов. Я всегда буду рядом несмотря не на что, ты всегда можешь написать мне и обратиться за помощью в любой ситуации. Ты очень сильная девушка и я знаю, что со всеми трудностями ты справишься. 
Надеюсь ты проведёшь этот день хорошо, мы все ждем тебя в Минске!! 
С днём рождения любимая. Целую и люблю ❤️🫂" />

          <Post username={"Лиза"} src={video3} text="стеша, поздравляю тебя с днём рождения! 💗
всего тебе хорошего , добра , любви , благополучия! 
я очень рада что именно такой человек как ты есть в моём окружении💘
с твоим днём , красотка ❤️💋" />

          <Post username={"Ваня и тд"} src={video4} text="-"/>

          <Post username={"Name"} src={video9} text="С днём рождения!!! 
Успехов, счастья, здоровья, больше счастливых моментов. Оставайся такой же красивой, обонятельной и милой! 🎂❤️"/>
          <Post username={"Амира"} src={video10} text="я тебя очень сильно люблю!!! не устану повторять то, какой ты добрый и лучезарный человечек, очень искренняя, милая и добрая💕 желаю тебе оставаться такой же позитивной, не сомневаться в себе и своих каких-то действиях, будь уверена во всем, помни, что все тебя очень любят, будь счастлива и здорова! ну и не забывай фиму держать в ежовых рукавицах, если там он обидит тебя—ты сразу мне, я решу👊🏿"/>
          
          <Post username={"Маруся и Маша"} src={video11} text="Маруся: С ДНЁМ РОЖДЕНИЯ!! всего тебе самого наилучшего! мечтай, люби, цвети! пусть радом будут только самые близкие и нужные тебе люди.
Я уверенна что ты добьёшься всего чего захочешь, а если будет сложно, рядом будут люди которые всегда помогут! ещё раз с твоим днём❤️
Маша: Стеша, с днем рождения!!! Желаю тебе оставаться таким же приятным и солнечным человеком. Твоя доброта и позитив всегда вызывают самые приятные эмоции. Проведи этот день как надо. С самыми лучшими пожеланиями, Маша🫶🏻💋"/>




          <Post username={"Назарик"} src={video15} text="стеша я хочу пожаелать тебе найти правильный путь который тебе будет нравится и наверное добрых и честных друзей💋"/>
          <Post username={"Паша и Федя"} src={video16} text="стеша, поздравляем тебя с пашей с днём рождения! желаем тебе крепкого здоровья, бесконечного счастья, успехов во всех начинаниях и увлечениях и, конечно же, крепких отношений и пылающей любви с серафимом!🍾🥂🥳"/>

          <Post username={"Лёша"} src={video17} text="Стеша, с днём рождения! Желаю успехов в карьерном росте, чтоб С2 по немецкому был, больше счастливых моментов в жизни и чтоб добилась своих целей и поставила новые. 🔥✡️💕💕💕💕💕"/>
          <Post username={"Ваня"} src={video18} text="стеша,поздравляю с днём рождения! желаю счастья,верных друзей и 7 дней ног в неделю🔥🥳"/>
          {/* <Post username={"Ваня и тд"} src={video4} text="-"/> */}


          <Post username={"Марк"} src={video24} text="-"/>
          <Post username={"Арсений и ещё кто-то"} src={video25} text="-"/>
          <Post username={"Артур"} src={video26} text="Поздравляю, Чепа)
Уже и не вспомню как давно мы познакомились…
Теперь то точно можно «отметить»)

Жду в гости😉"/>

          <Post username={"Герман"} src={video32} text="-"/>
          <Post username={"Антон"} src={video30} text="-"/>

          <Post username={"Тимофей"} src={video31} text="-"/>
        </div>
        <div className='wrapperInner_right'>
          <Post username={"Арсен и малой"} mt="120px" src={video5} text="С днём рождения ! Желаю успехов, счастья, любви и конечно здоровья !" />
          <Post username={"Влад"} src={video6} text="Стеша, поздравляю тебя с днем рождения, что бы у тебя были только хорошие моменты в жизни, Серафим радовал и все было хорошо" />
          <Post username={"Максим"} src={video7} text="Стеша,с днём рождения,там нагицев побольше хз там еще здоровья ну и всё короче" />
          <Post username={"Максим"} src={video8} text="с днем рождения стешулька, желаю тебе счастья, здоровья, всего, чего ты желаешь. побольше веселых моментов и приятных событий." />

          <Post username={"Полина"} src={video12} text="еще раз поздравляю с днём рождения, оставайся таким же светлым, милым, добрым человеком)
счастья, здоровья, любви, благополучия тебе😇🩵"/>
          <Post username={"Name 2    "} src={video13} text="стеша, поздравляю тебя с днём рождения!! желаю тебе здоровья, счастья, любви, чтобы твои мечты сбывались и успехов во всём! ты очень классная и красивая, пусть всё в жизни у тебя будет хорошо!!🫶🏻"/>
          <Post username={"Влад"} src={video14} text="В этот замечательный день хочу пожелать вам, Стефания, побольше хороших, надёжных друзей. Так же побольше улыбаться, поскольку благодаря вашей улыбке, солнце светиться ярче, ну и естественно много, примного евро"/>



          <Post username={"Тигр"} src={video19} text="С днем рождения, счастья здоровья и всего крутого"/>
          <Post username={"Глеб и Рома"} src={video20} text="Рома: Сегодня твой день рождения, моя подруга! Я желаю тебе, чтобы твоя жизнь была наполнена только яркими эмоциями, интересными встречами и приключениями. Пусть твои мечты сбываются, а желания исполняются. Желаю тебе крепкого здоровья, успехов в учебе и во всех начинаниях, а также много любви и счастья. С днем рождения!
Глеб: Дорогая Стеша, сегодня твой день рождения, и я хочу пожелать тебе самого лучшего! Ты - удивительный человек, и я рад, что мы общаемся. Желаю тебе, чтобы все твои мечты сбывались, а жизнь была наполнена радостью и счастьем. Пусть твои дни будут полны улыбок, а сердце - любовью. 
Я также хочу добавить, что ты можешь всегда рассчитывать на нашу поддержку, независимо от того, что происходит в твоей жизни. Мы всегда здесь, чтобы помочь тебе и поддержать тебя в трудные времена. Надеюсь, ты проведешь свой день рождения в кругу своих близких и друзей, и он будет наполнен радостью и счастьем. С днем рождения, Стеша!"/>
          <Post username={"Филип"} src={video21} text="С днём рождения!! Желаю счастья и всего самого наилучшего❤️"/>
          {/*  */}
          <Post username={"Наташа"} src={video22} text="Стешааа!
Поздравляю тебя с днём рождения!!
Ты очень хороший,классный,добрый человек!!
Желаю тебе счастья ,улыбок,здоровья и достижения всех целей !❤️"/>
          <Post username={"Аня"} src={video23} text="С твоим днём! Иди по жизни только вперёд и ты достигнешь всего, что захочешь 🫶🏼"/>




          <Post username={"Артём"} src={video27} text="-"/>
          <Post username={"Миша"} src={video28} text="стеша, желаю чтобы все твои цели на жизнь всегда сбывались, а близкие и друзья всегда были рядом и поддерживали тебя"/>
          <Post username={"Аня"} src={video23} text="-"/>


          <Post username={"Влада"} src={video29} text="-"/>
        </div>
      </div>
      <div className="FooterBlock">
        <h1>
          К сожалению не все смогли отправить видео по разным причинам, но все тебя очень любят и ценят. С днём рождения Сутефа💘
        </h1>
      </div>
    </div>
  );
}

export default App;
